[{"by":"edblarney","id":13075828,"kids":[13075938,13076641,13080927,13076666],"parent":13075709,"retrieved_on":1527836101,"text":"&#x27;Tax breaks&#x27; are offered to all sorts of industries.<p>Almost all entertainment in Canada for example, is done nearly tax free. Pharma, energy, small business etc. etc..","time":1480550409,"type":"comment"},
{"by":"jimmywanger","id":13075829,"parent":13071679,"retrieved_on":1527836101,"text":"&gt; Tell someone to &quot;just make a choice&quot; when they work paycheck to paycheck.<p>Wow, way to miss the point entirely. They are making a choice. Doing something they hate to remain getting paid.<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Learned_helplessness\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Learned_helplessness<\/a><p>Once you start thinking that you have no choice, that life is against you, it becomes self perpetuating. You don&#x27;t tell people &quot;just make a choice&quot; you make it very clear that they&#x27;re already making the choice. They&#x27;re the ones with agency.<p>Sure their choices have consequences, but all choices do. Ultimately they&#x27;re in charge of their destiny, unless of course they&#x27;re slaves and prisoners. No matter what you think&#x2F;say about Amazon, if you&#x27;re a software dev at Amazon, you are nowhere near a slave or prisoner.<p>If you think you have no control over your destiny, you&#x27;re destined to get stuck in the same rut and experience the same mistakes and pitfalls over and over again.","time":1480550436,"type":"comment"},
{"by":"hackuser","id":13075830,"kids":[13075879],"parent":13075542,"retrieved_on":1527836101,"text":"&gt; Is looking at some comics website even a privacy problem? Let&#x27;s say google finds out your user X looks at your website. What possible damage can they do?<p>What if they look at something politically unpopular, something that favors unpopular group or ideas? Those can be in comics. How about socially embarrassing things? They also determine you are in a certain place at a certain time. It is standard practice for governments to use those things to persecute people; there is no reason to think it will suddenly cease. I&#x27;m talking about western governments too - the U.S. government tried to embarrass and blackmail Martin Luther King; arguably it interfered in the recent election. Is there a reason governments would have changed?","time":1480550460,"type":"comment"},
{"by":"ris","id":13075831,"kids":[13075919],"parent":13072861,"retrieved_on":1527836101,"text":"And <i>this<\/i> is how software becomes closed-source in the cloud era.","time":1480550482,"type":"comment"},
{"by":"ianburrell","id":13075832,"parent":13075188,"retrieved_on":1527836101,"text":"Common law marriage is only a thing in eleven states. It requires the couple to present themselves as married.<p>Australia and Canada have common-law relationships that aren&#x27;t marriage but do involve dividing property in courts.","time":1480550488,"type":"comment"},
{"by":"gbraad","id":13075833,"parent":13075791,"retrieved_on":1527836101,"text":"Only as C-one or FPGA based, as a toy for my kid.<p>The old machines are still back home in Europe.","time":1480550502,"type":"comment"},
{"by":"alblue","id":13075834,"kids":[13078016],"parent":13073921,"retrieved_on":1527836101,"text":"Do you have a reference to the restrictions of what is prodced by &quot;say&quot;? Just because a tool may be GPL does not mean that its product need be (c.f. gcc)","time":1480550509,"type":"comment"},
{"by":"nonbel","id":13075835,"kids":[13076671],"parent":13075638,"retrieved_on":1527836102,"text":"You have it reversed.<p>&quot;Estimating parameters from sample&quot; (on the right) would be his observation that there was little discernible effect. Thinking that 1000 reprints of the paper would have a larger effect on practice would more correspond to &quot;theory&quot; (on the left), although that is a pretty vague one.","time":1480550516,"type":"comment"},
{"by":"swhipple","id":13075836,"parent":13075047,"retrieved_on":1527836102,"text":"That is true, but somewhat alleviated by Emacs&#x27; choice to indent the THEN form at a different level than [ELSE]*.  A novice would notice that the code looks incorrect as they were typing it.","time":1480550542,"type":"comment"},
{"by":"ChefDenominator","id":13075837,"kids":[13076213],"parent":13075615,"retrieved_on":1527836102,"text":"I would interpret your statement to indicate you are an opponent of free exchange of ideas.","time":1480550545,"type":"comment"},
{"by":"ARothfusz","id":13075838,"kids":[13077764,13077765],"parent":13075773,"retrieved_on":1527836102,"text":"We are an oil exporter. We did change the laws.\n<a href=\"http:&#x2F;&#x2F;money.cnn.com&#x2F;2016&#x2F;06&#x2F;06&#x2F;investing&#x2F;us-oil-exports-increase&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;money.cnn.com&#x2F;2016&#x2F;06&#x2F;06&#x2F;investing&#x2F;us-oil-exports-inc...<\/a>","time":1480550555,"type":"comment"},
{"by":"Impossible","descendants":0,"id":13075839,"retrieved_on":1527836102,"score":4,"time":1480550562,"title":"VR the biggest loser this holiday?","type":"story","url":"http:\/\/www.gamesindustry.biz\/articles\/2016-11-29-vr-the-biggest-loser-this-holiday"},
{"by":"paulddraper","id":13075840,"parent":13073190,"retrieved_on":1527836102,"text":"DynamoDB and S3 are infinitely scalable.<p>Aurora is scalable to 64TB. For 10 million users, that&#x27;s 6MB per user.","time":1480550566,"type":"comment"},
{"by":"noir_lord","id":13075841,"parent":13075347,"retrieved_on":1527836102,"text":"The UK is &quot;Innocent until proven Guilty&quot; except for specific exemptions (mostly related to not handing over encryption passwords, which is an offence itself..a lovely little logical trap they snuck in on that one didn&#x27;t they).","time":1480550575,"type":"comment"},
{"by":"forrestthewoods","id":13075842,"kids":[13075860,13075913,13075981],"parent":13074667,"retrieved_on":1527836103,"text":"I&#x27;m not familiar with some of these operations. I don&#x27;t know what a Rust &quot;slice&quot; is. Or what &quot;Zip&quot; does.<p>Could someone show me the most straight forward equivalent in vanilla C? I assume there is no direct equivalent as temporary storage will be needed. But that&#x27;s fine and would further serve the purpose of explaining why Rust is cool.<p>Thanks.","time":1480550588,"type":"comment"},
{"by":"ams6110","id":13075843,"kids":[13075950,13075957],"parent":13075603,"retrieved_on":1527836103,"text":"People are allowed to work on their own cars, including brakes, suspension, steering, etc. Happens every day in driveways everywhere. I do it myself.","time":1480550590,"type":"comment"},
{"by":"rl3","descendants":0,"id":13075844,"retrieved_on":1527836103,"score":3,"time":1480550598,"title":"Reddit will punish 'toxic users' and hide some posts from pro-Trump community","type":"story","url":"http:\/\/www.theverge.com\/2016\/11\/30\/13797712\/reddit-trump-the-donald-ban"},
{"by":"danharaj","id":13075845,"kids":[13075997],"parent":13075134,"retrieved_on":1527836103,"text":"Of course, the same is true of capitalists; we don&#x27;t notice anymore because their program for world domination has mostly succeeded. It wasn&#x27;t peaceful either.","time":1480550634,"type":"comment"},
{"by":"hackuser","id":13075846,"parent":13075704,"retrieved_on":1527836103,"text":"&gt; This is a conscious decision that the user has made to use Chrome and send their URLs to Google<p>Not to pick on this one point, but I want to add that I doubt many users are really conscious of it. People on HN are in a bubble; go to the local mall and ask people what they know. Ask them what a web browser is.<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=o4MwTvtyrUQ\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=o4MwTvtyrUQ<\/a><p>That&#x27;s why people in the IT field have a responsibility to provide safe products to the public. It&#x27;s like someone on Wall Street saying that a typical person is making a &#x27;conscious decision&#x27; to accept all the complex risks of a sophisticated financial instrument, or that I&#x27;m making a &#x27;conscious decision&#x27; to accept all the risks of an airplane when I get on it - I have little idea how the plane works; it&#x27;s up to the manufacturer, airline and goverment to ensure it&#x27;s safe.","time":1480550635,"type":"comment"},
{"by":"Scoundreller","id":13075847,"parent":13075731,"retrieved_on":1527836103,"text":"&gt; I wonder what will happen to the price of jet fuel once electric cars are wide spread.<p>Probably the same thing that happened to coal<i>, it just gets used elsewhere.<p><\/i>Historically used for heating, trains and ships","time":1480550637,"type":"comment"},
{"by":"daveleebbc","id":13075848,"parent":13073029,"retrieved_on":1527836103,"text":"Hm - I take your point. I was coming at it from a public safety point of view first and foremost. But I can see the other side, sure.","time":1480550643,"type":"comment"},
{"by":"wheelerwj","id":13075849,"kids":[13079363,13078414],"parent":13075518,"retrieved_on":1527836104,"text":"&gt; It sounds like you&#x27;re just downstream<p>How would you know? You haven&#x27;t asked me any questions at all?  All you&#x27;ve done is make assumptions  and then tell me you didn&#x27;t want my business.","time":1480550644,"type":"comment"},
{"deleted":true,"id":13075850,"retrieved_on":1527836104,"time":1480550648,"type":"story"},
{"by":"noir_lord","id":13075851,"parent":13072360,"retrieved_on":1527836104,"text":"What does one have to do with the other?<p>Does the UK passing the investigatory powers act in any way have any bearing on abuses by the legal system in other countries or are we just playing &quot;whataboutism bingo&quot; today?","time":1480550650,"type":"comment"},
{"by":"fpgaminer","id":13075852,"kids":[13076481,13079861,13077592],"parent":13072432,"retrieved_on":1527836104,"text":"These FPGAs are absolutely _massive_ (in terms of available resources).  AWS isn&#x27;t messing around.<p>To put things into practical perspective my company sells an FPGA based solution that applies our video enhancement technology in real-time to any video streams up to 1080p60 (our consumer product handles HDMI in and out).  It&#x27;s a world class algorithm with complex calculations, generating 3D information and saliency maps on the fly.  I crammed that beast into a Cyclone 4 with 40K LEs.<p>It&#x27;s hard to translate the &quot;System Logic Cells&quot; metric that Xilinx uses to measure these FPGAs, but a pessimistic calculation puts it at about 1.1 million LEs.  That&#x27;s over 27 times the logic my real-time video enhancement algorithm uses.  With just one of these FPGAs we could run our algorithm on 6 4K60 4:4:4 streams at once.  That&#x27;s insane.<p>For another estimation, my rough calculations show that each FPGA would be able to do about 7 GH&#x2F;s mining Bitcoin.  Not an impressive figure by today&#x27;s standards, but back when FPGA mining was a thing the best I ever got out of an FPGA was 500 MH&#x2F;s per chip (on commercially viable devices).<p>I&#x27;m very curious what Amazon is going to charge for these instances.  FPGAs of that size are incredibly expensive (5 figures each).  Xilinx no doubt gave them a special deal, in exchange for the opportunity to participate in what could be a very large market.  AWS has the potential to push a lot of volume for FPGAs that traditionally had very poor volume.  IntelFPGA will no doubt fight exceptionally hard to win business from Azure or Google Cloud.<p>* Take all these estimates with a grain of salt.  Most recent &quot;advancements&quot; in FPGA density are the result of using tricky architectures.  FPGAs today are still homogeneous logic, but don&#x27;t tend to be as fine grained as they were.  In other words, they&#x27;re basically moving from RISC to CISC.  So it&#x27;s always up in the air how well all the logic cells can be utilized for a given algorithm.","time":1480550677,"type":"comment"},
{"by":"ComteDeLaFere","id":13075853,"kids":[13080122],"parent":13075421,"retrieved_on":1527836104,"text":"I read <i>The Strange Last Voyage of Donald Crowhurst<\/i> in high school, and can recommend that as well.","time":1480550686,"type":"comment"},
{"by":"imarsman","id":13075854,"kids":[13075956],"parent":13075526,"retrieved_on":1527836104,"text":"I use an rss reader on my phone only. I use emacs for other stuff, except for work projects, for which I use Eclipse, and personal projects, for which I use Xcode.","time":1480550691,"type":"comment"},
{"by":"sedachv","id":13075855,"parent":13074131,"retrieved_on":1527836104,"text":"This is Lisp on the IBM 704&#x2F;7090 and PDP-1 in 1960-1964. Ritchie would not start work on C until 1969 and there was no standard C library (which, btw, is completely irrelevant to the runtime state of a process) for decades. There were no processes or virtual memory (the 7090 didn&#x27;t even have overlays) or non-Lisp stuff other than the punch card&#x2F;paper tape loader.","time":1480550693,"type":"comment"},
{"by":"boredandroid","descendants":0,"id":13075856,"retrieved_on":1527836105,"score":3,"time":1480550694,"title":"Exactly-Once Delivery and Transactional Messaging in Apache Kafka","type":"story","url":"https:\/\/cwiki.apache.org\/confluence\/display\/KAFKA\/KIP-98+-+Exactly+Once+Delivery+and+Transactional+Messaging"},
{"by":"meira","id":13075857,"parent":13075700,"retrieved_on":1527836105,"text":"Nothing. I prefer free news the same way I prefer torrent for music.","time":1480550709,"type":"comment"},
{"by":"daveleebbc","id":13075858,"parent":13070651,"retrieved_on":1527836105,"text":"That&#x27;s exactly the difference. Mr Woods (the defender I quote in the story) described the old system as something a computer hacker would use in a Hollywood movie... but it worked and was stable.","time":1480550712,"type":"comment"},
{"by":"mikeash","id":13075859,"kids":[13077065],"parent":13075731,"retrieved_on":1527836105,"text":"You can see this at work already with gasoline for small planes, which commands a huge premium over automotive gasoline now. Around here, the cost is 2x higher or more. The premium used to be smaller, but when gas prices came down from their $4 high, avgas didn&#x27;t really follow.","time":1480550712,"type":"comment"},
{"by":"steveklabnik","id":13075860,"kids":[13075920],"parent":13075842,"retrieved_on":1527836105,"text":"A slice is a pointer + a length. Zip takes two iterators and gives an iterator that returns pairs of elements from each of them.<p>For an imperative translation see <a href=\"https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;programming&#x2F;comments&#x2F;5fpghn&#x2F;zerocost_abstractions&#x2F;dam19ax&#x2F;?st=iw5lpml6&amp;sh=4c17bb07\" rel=\"nofollow\">https:&#x2F;&#x2F;www.reddit.com&#x2F;r&#x2F;programming&#x2F;comments&#x2F;5fpghn&#x2F;zerocos...<\/a><p>Doing an exact translation to C is hard. The C that does the same thing, or C that demonstrates these abstractions that are boiling away?","time":1480550732,"type":"comment"},
{"by":"nkozyra","id":13075861,"parent":13075696,"retrieved_on":1527836105,"text":"Cached per browser, though, which is significantly different than cached per request.<p>Even if you&#x27;re caching&#x2F;serving static content efficiently it still adds load to a server.","time":1480550734,"type":"comment"},
{"by":"cypher543","id":13075862,"kids":[13075895],"parent":13074738,"retrieved_on":1527836105,"text":"That&#x27;s pretty common among TTS services and engines. Most people want a female voice for their personal assistant&#x2F;ebook reader&#x2F;whatever, so the male voices don&#x27;t seem to get as much tuning. As someone who happens to prefer a male voice on my apps, it&#x27;s a little frustrating.","time":1480550735,"type":"comment"},
{"by":"jaskerr","id":13075863,"kids":[13076144],"parent":13062613,"retrieved_on":1527836106,"text":"That&#x27;s pretty cool. Do you have a website? I have questions, and you probably have answers. (Like, how do IT-averse businesses manage the text&#x2F;graphics&#x2F;etc? ... and so on)","time":1480550745,"type":"comment"},
{"deleted":true,"id":13075864,"retrieved_on":1527836106,"time":1480550764,"type":"story"},
{"by":"daveleebbc","id":13075865,"parent":13072660,"retrieved_on":1527836106,"text":"I think it&#x27;s more complex than checking twice. You can&#x27;t check twice for something that doesn&#x27;t exist on a record but should, for example. How would you know what to look for?","time":1480550768,"type":"comment"},
{"by":"trhway","id":13075866,"parent":13075794,"retrieved_on":1527836106,"text":"it isn&#x27;t exactly revelation. The domestic fight (basically for the control over Russia&#x27;s economy, especially &quot;grayish&quot; parts of it) between FSB economic security dept (when it was taken over by new rising faction inside) on one side and economy&#x2F;corruption related structures of police&#x2F;Interior Ministry&#x2F;Investigative Committee on the other side has been going pretty much in the open for about 3 years with FSB clearly (an not surprisingly at all) winning. During that time there have been a number of high profile arrests, including for example the head of Internal Affairs of the Investigative Committee together with some other high profiles there several months ago - that brought the Investigative Committee onto the side of and under the control by FSB.<p>The opening salvo of the war, like a comedy setup, was when the 2 opposing teams - FSB and the other side - tried to setup and arrest each other for bribery in a restaurant with the FSB team succeeding  <a href=\"http:&#x2F;&#x2F;www.newyorker.com&#x2F;magazine&#x2F;2015&#x2F;07&#x2F;27&#x2F;the-double-sting\" rel=\"nofollow\">http:&#x2F;&#x2F;www.newyorker.com&#x2F;magazine&#x2F;2015&#x2F;07&#x2F;27&#x2F;the-double-stin...<\/a> which immediately led to the arrest of the head of anti-corruption department of the Interior Ministry - general Sugrobov - and his deputy general Kolesnikov.","time":1480550775,"type":"comment"},
{"by":"zzleeper","id":13075867,"parent":13075768,"retrieved_on":1527836106,"text":"That was not his point. When you extract oil, you don&#x27;t really get a single product but multiple ones (heavy oils, lubricants, etc.)<p>Before you might be selling lubricants cheaply, because after refinement you had lots of lubricants as a by-product. If you need less car fuel, this changes the cost equation and lubricants (and other byproducts) might become more expensive even if car fuel becomes cheaper.","time":1480550786,"type":"comment"},
{"by":"CalChris","id":13075868,"kids":[13075992],"parent":13075820,"retrieved_on":1527836106,"text":"... in style with a queen sac on the final move, a mate in 8 while under threat of mate. Bravo Magnus!","time":1480550787,"type":"comment"},
{"by":"Manishearth","id":13075869,"kids":[13077809],"parent":13075724,"retrieved_on":1527836106,"text":"All of the optimizations were done by llvm, so nothing stopping this from working in C++ with closures or C with functions annotated for inlining.<p>With C the lack of generics means that writing composable iterators is hard, though.","time":1480550795,"type":"comment"},
{"by":"daveleebbc","id":13075870,"parent":13073799,"retrieved_on":1527836106,"text":"To be fair - it&#x27;s been covered by the East Bay Times, SF Chron and KQED in some depth. That&#x27;s how I heard about it.","time":1480550807,"type":"comment"},
{"by":"ghaff","id":13075871,"parent":13075624,"retrieved_on":1527836107,"text":"The French sounds a bit flat to me but I could easily mistake it for a somewhat bored human reading in mostly a monotone. But I certainly don&#x27;t know French well enough to be sensitive to unnatural pauses or odd inflections.<p>It really is quite good--even if I really wouldn&#x27;t want to read an entire book read this way or would mistake it for a human. It definitely gets me thinking about ways to use this service.","time":1480550825,"type":"comment"},
{"by":"wcummings","id":13075872,"kids":[13075910],"parent":13075739,"retrieved_on":1527836107,"text":"This could change faster than you think, I wouldn&#x27;t be surprised if there was <i>a lot<\/i> more solar in 50 years. Solar is now getting to the point it can compete w&#x2F; fossil fuels on price, w&#x2F;o subsidies.","time":1480550830,"type":"comment"},
{"by":"_FKS_","id":13075873,"parent":13075436,"retrieved_on":1527836107,"text":"Nothing happens at night, there&#x27;s no electricity output. You need some kind of storage on the back-end if you want to store the day&#x27;s surplus electricity. Molten salt or hydro work well and can store the electricity, in order to distribute it at night time.<p>But in practice, this is mitigated by the actual power grid, another plant(s) somewhere else would take over at night. On a coal plant it is harder to adjust the load factor on the fly, it is not instantaneous. On a gas plant or a hydro dam, it is a matter of minutes, the turbines can start very quickly. That&#x27;s why usually when such utility-scale renewable plants are installed, they need to be paired with another load-following plant, such as gas.  Nevertheless, a renewable+gas&#x2F;coal plant means less CO2 emissions, so I guess it&#x27;s a good thing.","time":1480550844,"type":"comment"},
{"by":"meira","id":13075874,"kids":[13078073],"parent":13075610,"retrieved_on":1527836107,"text":"Meteor didn&#x27;t catch up with the expectation. Arunoda is a great developer, the biggest name in Meteor Community. I don&#x27;t see a bright future ahead for them.","time":1480550846,"type":"comment"},
{"by":"halflings","id":13075875,"kids":[13076390],"parent":13074411,"retrieved_on":1527836107,"text":"I don&#x27;t think Google is marketing their Cloud NLP&#x2F;Vision APIs for big enterprise customers that have very specific needs. Those APIs are meant for people that have common needs ( = want to identify which items or people are on a photo, understand queries in commonly used languages, etc.)<p>If you have specific needs, then you can use TensorFlow running on the app engine (as they will soon be providing hosted and GPU-accelerated instances), which at worst makes it equal to Amazon offering... but something tells me the vast majority of Google Cloud customers will be satisfied with pre-trained models that can be applied on a very large swath of problems.","time":1480550851,"type":"comment"},
{"by":"josu","id":13075876,"parent":13074636,"retrieved_on":1527836107,"text":"&gt;any other chemical that hard those sorts of toxic affects.<p>Like bleach?","time":1480550855,"type":"comment"},
{"by":"ams6110","id":13075877,"parent":13074389,"retrieved_on":1527836107,"text":"Apply the brakes and stay in the right-of-way. The fact that there is a child in the road is <i>someone else&#x27;s fault<\/i> i.e. whoever is supposed to be supervising the child. Chosing to depart from the road would certainly be the wrong choice, since now you might hurt&#x2F;damage something or someone that is minding its own business and is where it is supposed to be.","time":1480550878,"type":"comment"},
{"by":"x13","id":13075878,"parent":13075747,"retrieved_on":1527836108,"text":"&quot;never to worry about it again&quot; .. i guess this is why i stopped renting a cabinet at level 3 .. when a hard drive dies, who wants to go fix it?","time":1480550887,"type":"comment"},
{"by":"olegkikin","id":13075879,"parent":13075830,"retrieved_on":1527836108,"text":"I&#x27;m talking specifically about this particular comic website.<p>Yes, I fully understand the need for privacy when it comes to political and other social issues.","time":1480550889,"type":"comment"},
{"by":"alistairSH","id":13075880,"kids":[13076625],"parent":13075180,"retrieved_on":1527836108,"text":"<i>It isn&#x27;t the developer who has signed the contract<\/i><p>Yes, and that&#x27;s the problem.  The engineer didn&#x27;t sign the contract either, but he DID sign his name on the design.  There should be some equivalent in software.<p>And just as not all &quot;engineers&quot; are professional engineers (licensed), not all software developers should need to be licensed.  But, for something like descried in the original article, there damn sure ought to be somebody to hold accountable.","time":1480551030,"type":"comment"},
{"by":"jasonnovack","id":13075881,"kids":[13075897],"parent":13075764,"retrieved_on":1527836108,"text":"Hey, Jason from Clarifai here. Reach out to us. I&#x27;d be interested in hearing more about your ideas, and how we might be able to support them. Fun fact: we&#x27;re willing to give volume discounts based on number of concepts, inputs (indexed image search results), or predictions (tagged images).","time":1480551041,"type":"comment"},
{"by":"maxerickson","id":13075882,"parent":13075813,"retrieved_on":1527836108,"text":"There&#x27;s all sorts of processes used to convert stuff.<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Cracking_(chemistry)\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Cracking_(chemistry)<\/a>","time":1480551053,"type":"comment"},
{"by":"cauterized","id":13075883,"parent":13074677,"retrieved_on":1527836108,"text":"Height adjustable desks are a huge ergonomic win but also a major increased cost. Pneumatic dynamically-adjusting ones are even better for the sit-stand option.<p>Not everyone&#x27;s the same height, you see, and even at the same height people have different leg to torso ratios. A typical desk is 30-36&quot; high. I&#x27;m most comfortable with mine adjusted to 24&quot;.<p>For chairs, I suggest setting a budget for each engineer and letting them choose their own.","time":1480551057,"type":"comment"},
{"by":"paulddraper","id":13075884,"parent":13075491,"retrieved_on":1527836108,"text":"AWS pushes Cloudformation.<p>You won&#x27;t find it in a getting started guide, because it&#x27;s simpler not to.<p>Also, there are caveats like &quot;make sure it doesn&#x27;t shut down your database&quot;","time":1480551062,"type":"comment"},
{"by":"stackchief","dead":true,"id":13075885,"retrieved_on":1527836109,"score":1,"time":1480551076,"title":"ES6 and Why It's Important","type":"story","url":"https:\/\/www.stackchief.com\/blog\/ES6%20and%20Why%20Is%20It%20Important%3F"},
{"by":"beardog","id":13075886,"parent":13075199,"retrieved_on":1527836109,"text":"The code injection problem can often (but not always) be solved via Subresource Intergrity <a href=\"https:&#x2F;&#x2F;developer.mozilla.org&#x2F;en-US&#x2F;docs&#x2F;Web&#x2F;Security&#x2F;Subresource_Integrity\" rel=\"nofollow\">https:&#x2F;&#x2F;developer.mozilla.org&#x2F;en-US&#x2F;docs&#x2F;Web&#x2F;Security&#x2F;Subres...<\/a>","time":1480551077,"type":"comment"},
{"by":"baybal2","id":13075887,"kids":[13077876],"parent":13073769,"retrieved_on":1527836109,"text":"&gt;Can a simplistic malware fraud generate half<p>&quot;Surprise&quot; billionaires are popping out of Eastern Europe&#x2F;Israel&#x2F;Russia&#x2F;Russian concessions every year.<p>The guy who ran ebanners&#x2F;advmaker was said to have lost $1.3bn when Cyprus seized deposits. Before he filed the case against the bank, nobody ever knew of the guy.<p>They are very good at hiding cash. All those dumb banking AML rules are kinda useless as the easiest way to launder money is to run your own bank.<p>Just back in 2013, ads for sale of &quot;1 day banks&quot; in UK&#x2F;Ireland&#x2F;Delaware&#x2F;Cyprus were openly published in Russia&#x27;s number 1 business magazine.","time":1480551082,"type":"comment"},
{"by":"icanhackit","id":13075888,"kids":[13078704],"parent":13075384,"retrieved_on":1527836109,"text":"As someone who has dabbled with all three I&#x27;d recommend starting with cannabis then MDMA and finally, in a safe environment, LSD. With one-off doses toxicity isn&#x27;t your major concern, it&#x27;s potential self harm through being unacquainted with different states of mind and control. Start on the more familiar end and work your way up if you&#x27;re confident in your state of mind and sense of control.<p>For the record I&#x27;ve never had a bad experience with any of them. I&#x27;d say cannabis and MDMA are my favorite substances, though I mix them with tobacco and alcohol so I suspect there&#x27;s a synergistic effect where my reward center is being lit up like a Christmas tree. FWIW I don&#x27;t go out to raves or clubs - I&#x27;m old and an introvert - I just hang out with friends in our own homes or outdoors near our homes so the risks are lower.","time":1480551100,"type":"comment"},
{"by":"giovannibajo1","id":13075889,"parent":13075332,"retrieved_on":1527836109,"text":"I would say it&#x27;s true in general for us non native speakers to understand other non native speakers better than native speakers (unless their English is so garbled that becomes too hard...). But it&#x27;s even more especially true for English pronounced by people born in our own country; that&#x27;s the easiest by a far amount","time":1480551122,"type":"comment"},
{"by":"EGreg","id":13075890,"kids":[13076588],"parent":13072311,"retrieved_on":1527836109,"text":"I bet they did something besides this. How did they get people to VISIT THEIR PAGE on kickstarter? Were they featured on KS front page? Featured elsewhere? How did the word of mouth spread? THAT IS WHAT I WANT TO KNOW","time":1480551144,"type":"comment"},
{"by":"pragone","id":13075891,"parent":13075773,"retrieved_on":1527836109,"text":"The US, like everyone else in the world, will always be an oil exporter and an oil importer.  The grades of oil differ throughout the world, and are used in different industries.","time":1480551153,"type":"comment"},
{"by":"kamaal","id":13075892,"parent":13075317,"retrieved_on":1527836110,"text":"But that isn&#x27;t what happened there. The wife quit the job on intention so that she could be eligible for free alimony pay from the husband.<p>Why work and make a living, while you could skin this man alive and have him pay for you.<p>This sort of behavior incentivizes divorce. Not that hard to play victim when you can get some one to pay for you all life, while you chill around beaches and make merry.","time":1480551177,"type":"comment"},
{"by":"sardarkabir","dead":true,"id":13075893,"retrieved_on":1527836110,"score":1,"time":1480551183,"title":"Foreign-ownership-of-condos-down-in-big-cities-cmhc","type":"story","url":"http:\/\/www.sardarkabir.ca\/foreign-ownership-of-condos-down-in-big-cities-cmhc#.WD9rDH2Z5Kk.hackernews"},
{"by":"paulcole","id":13075894,"kids":[13076435],"parent":13070264,"retrieved_on":1527836110,"text":"&gt; MDMA has an exceptionally small potential for long term abuse when compared to most other drugs.<p>(Citation Needed)","time":1480551201,"type":"comment"},
{"by":"ghaff","id":13075895,"parent":13075862,"retrieved_on":1527836110,"text":"I don&#x27;t know how much is tuning and how much is personal preference but I plugged in some different texts and I&#x27;d probably default to Amy (English, British).","time":1480551214,"type":"comment"},
{"by":"jasonnovack","id":13075896,"parent":13075043,"retrieved_on":1527836110,"text":"<a href=\"https:&#x2F;&#x2F;developer-preview.clarifai.com&#x2F;guide&#x2F;train#train\" rel=\"nofollow\">https:&#x2F;&#x2F;developer-preview.clarifai.com&#x2F;guide&#x2F;train#train<\/a>","time":1480551220,"type":"comment"},
{"by":"davidbarker","id":13075897,"parent":13075881,"retrieved_on":1527836110,"text":"Thanks for getting in touch, Jason. That&#x27;s good to hear! I&#x27;ll be sure to contact you when I&#x27;ve sifted through my ideas.","time":1480551247,"type":"comment"},
{"by":"stn","id":13075898,"parent":13067727,"retrieved_on":1527836110,"text":"What about unwanted parts which are removed intentionally? Wisdom teeth and appendicitis come to mind. Or body parts intentionally modified by surgery.\nBasically, unless there is some control regarding which part to regrow, this might not always be desirable.","time":1480551249,"type":"comment"},
{"by":"ImpressiveWebs","descendants":0,"id":13075899,"retrieved_on":1527836111,"score":2,"time":1480551251,"title":"Economics in One Lesson by Henry Hazlitt (1946)","type":"story","url":"http:\/\/steshaw.org\/economics-in-one-lesson\/"},
{"by":"tidwall","descendants":0,"id":13075900,"retrieved_on":1527836111,"score":4,"time":1480551269,"title":"Using GJSON – A Fast JSON Parser for Go","type":"story","url":"https:\/\/medium.com\/@tidwall\/using-gjson-a-fast-json-parser-for-go-f1705957a49a#.s54ozx2yb"},
{"by":"CoolGuySteve","id":13075901,"kids":[13076139,13075969,13075996,13076276],"parent":13075763,"retrieved_on":1527836111,"text":"One thing I&#x27;m noticing with cable-cutting is that the market is getting more fragmented.  Instead of just getting Netflix and watching free Hulu with ads, now you have to get Netflix, Amazon Prime, HBO Now, pay for Hulu, buy the Starz app, pay for MLB, etc.  in order to compose all the content you want.<p>It&#x27;s equivalent to buying cable packages where you spend money on a bundle engineered to have only 20% of what you want.  The only difference is that it&#x27;s all video-on-demand now.","time":1480551290,"type":"comment"},
{"by":"ckcortright","descendants":0,"id":13075902,"retrieved_on":1527836111,"score":1,"time":1480551302,"title":"The Problem of Defining Autonomous Weapons","type":"story","url":"http:\/\/futureoflife.org\/2016\/11\/30\/problem-defining-autonomous-weapons\/"},
{"by":"Whitestrake","id":13075903,"kids":[13076905],"parent":13072904,"retrieved_on":1527836111,"text":"Genuinely curious to hear if that &quot;gitignore had a typo&quot; 10k bill has a story behind it!","time":1480551309,"type":"comment"},
{"by":"wastinglife123","id":13075904,"kids":[13078910],"parent":13073678,"retrieved_on":1527836111,"text":"if this is to be &quot;expected&quot; then why would anyone get married in California? Can you imagine the psychological cost of paying for your ex-wife (who initiated the divorce and planned well in advance to maximize her financial position) to enjoy herself without working?","time":1480551310,"type":"comment"},
{"by":"jasonnovack","id":13075905,"parent":13073576,"retrieved_on":1527836111,"text":"Clarifai: <a href=\"https:&#x2F;&#x2F;developer-preview.clarifai.com&#x2F;quick-start&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;developer-preview.clarifai.com&#x2F;quick-start&#x2F;<\/a>","time":1480551340,"type":"comment"},
{"by":"taylorbuley","descendants":0,"id":13075906,"retrieved_on":1527836112,"score":1,"time":1480551346,"title":"Apple's Further Steps for WoSign","type":"story","url":"https:\/\/groups.google.com\/forum\/#!topic\/mozilla.dev.security.policy\/EqkAdP4nQ_s"},
{"by":"aurosys","dead":true,"id":13075907,"retrieved_on":1527836112,"score":1,"time":1480551360,"title":"4 Innovative High-Tech Gadgets Introduced","type":"story","url":"http:\/\/www.aurosyssolutions.com\/technology-innovation\/4-innovative-high-tech-gadgets-introduced\/"},
{"by":"kutkloon7","id":13075908,"kids":[13075929,13076494],"parent":13074667,"retrieved_on":1527836112,"text":"I like the idea of zero-cost abstractions very much. I think that eventually, we will move to functionally proven code - which is, of course, also a zero-cost abstraction, since functional verification is normally done at compile-time.<p>The snippet presented is completely unreadable to me though, and I think that in general, Rust is too hard to understand (and has some syntax which seems quite arbitrary).","time":1480551367,"type":"comment"},
{"by":"dfrey","id":13075909,"parent":13074667,"retrieved_on":1527836112,"text":"Why no constant for the value 12?   :(","time":1480551377,"type":"comment"},
{"by":"toomuchtodo","id":13075910,"kids":[13075935],"parent":13075872,"retrieved_on":1527836112,"text":"12-16 years till solar is the dominant form of power generation at its current growth rate.<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Growth_of_photovoltaics\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Growth_of_photovoltaics<\/a><p>There isn&#x27;t anything to indicate that growth curve will slow; the manufacturing capacity is already in place, and more continues to be added. There are power purchase agreements at 2 cents&#x2F;kWh, and I would not be surprised if you see prices below 1 cent&#x2F;kwh in the next five years.<p><a href=\"http:&#x2F;&#x2F;www.pv-tech.org&#x2F;news&#x2F;43695\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pv-tech.org&#x2F;news&#x2F;43695<\/a><p><a href=\"https:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;articles&#x2F;2016-05-03&#x2F;solar-developers-undercut-coal-with-another-record-set-in-dubai\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;articles&#x2F;2016-05-03&#x2F;solar-dev...<\/a>","time":1480551390,"type":"comment"},
{"by":"woofyman","id":13075911,"parent":13075709,"retrieved_on":1527836112,"text":"Carrier is the latest recipient of a tax break.<p><a href=\"http:&#x2F;&#x2F;www.zerohedge.com&#x2F;news&#x2F;2016-11-30&#x2F;carrier-issues-statement-trump-deal-incentives-offered-were-important-consideration\" rel=\"nofollow\">http:&#x2F;&#x2F;www.zerohedge.com&#x2F;news&#x2F;2016-11-30&#x2F;carrier-issues-stat...<\/a>","time":1480551422,"type":"comment"},
{"by":"Synaesthesia","id":13075912,"kids":[13078795],"parent":13075134,"retrieved_on":1527836112,"text":"Yes communnism represented a real threat to the American ruling class, the threat of workers taking matters in their own hands. We must also look at the US labor history which is among the most violent in the world, (except Tsarist Russia) After many bloody labor wars, US labour was basically crushed in the 20&#x27;s only to rise again in the 30&#x27;s and then be mostly deestroyed after WW2 again.<p><a href=\"https:&#x2F;&#x2F;chomsky.info&#x2F;nothing-for-other-people-class-war-in-the-united-states&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;chomsky.info&#x2F;nothing-for-other-people-class-war-in-t...<\/a>","time":1480551448,"type":"comment"},
{"by":"thenewwazoo","id":13075913,"kids":[13075943,13075924],"parent":13075842,"retrieved_on":1527836113,"text":"Uh, the C equivalent might be something like<p><pre><code>    uint32_t *buffer = ...;\n    uint64_t coefficients[12] = {...};\n    uint16_t qlp_shift = ...;\n\n    uint32_t *bufp = &amp;buffer[...];\n    uint64_t sum;\n    for (size_t i = 0; i &lt; 12; i++)\n        sum += coefficients[i] * bufp[i-12];\n    uint64_t prediction = sum &gt;&gt; qlp_shift;\n    *bufp += (uint32_t)prediction;\n<\/code><\/pre>\nEdit: this is incorrect","time":1480551464,"type":"comment"},
{"by":"sintaxi","id":13075914,"parent":13072891,"retrieved_on":1527836113,"text":"Not to mention...<p>- no regions outside U.S.\n- no floating IPs\n- no Debian images<p>DO appears to have a considerably better offering.","time":1480551485,"type":"comment"},
{"by":"halayli","id":13075915,"parent":13073331,"retrieved_on":1527836113,"text":"You want me to trust my life with a source code that uses zmq? no thanks.","time":1480551492,"type":"comment"},
{"by":"johncolanduoni","id":13075916,"parent":13074621,"retrieved_on":1527836113,"text":"It&#x27;s also important to note that you can embed SMT-driven refinement types into a fully dependently typed language; that&#x27;s what F* does. I wonder how feasible doing something similar in Idris via the elaborator reflection and type provider faculties is. I remember Brady did something following a similar principle in one of the elaborator reflection papers with automated proofs of termination, but without calling into an external SMT solver.","time":1480551493,"type":"comment"},
{"by":"phaed","id":13075917,"kids":[13076921,13076003],"parent":13072311,"retrieved_on":1527836113,"text":"You killed VideoPixie.  Bad time to be down.","time":1480551493,"type":"comment"},
{"by":"bigiain","id":13075918,"kids":[13077757],"parent":13075732,"retrieved_on":1527836113,"text":"Sure - maybe I used a poor example. Apologies.<p>But.<p>There&#x27;s nothing &quot;unexpected&quot; or &quot;unagreed beforehand&quot; about Amazon&#x27;s pricing or costs either. You order a medium EC2 instance and we all know exactly what the bill per hour will be.<p>There&#x27;s nothing unexpected or un agreed beforehand about the ordering&#x2F;provisioning process. You ask AWS to start one, they&#x27;ll start one. You tell them to stop it, they&#x27;ll stop it. You get charged the known agreed upon rate for the hours you run it. You ask for 10, you get 10. There&#x27;s even checks in place - the first time you ask for 50, you hit a limit which you need to speak to them to get raised before you can get a larger than previously seem bill.<p>Same with your earthmoving gear. You ring up for prices and they&#x27;ll say &quot;$200&#x2F;day for a bobcat, $2500&#x2F;day for a D9 - includes free delivery in The Bay Area!&quot;<p>If you need one bobcat for one day at 10 Infinite Loop, Cupertino - and click their web order form and say you want 10 D9s for one day at 1 Infinite Loop, Cupertino (and happily click thru all the never-read the web interface confirmations) - you should 100% expect to get a bill for $25k, as well as dealing with clearing up after parking 10 &#x27;dozers in Apple&#x27;s parking lot.<p>This is not &quot;unexpected&quot;. From the vendor&#x27;s perspective $25k is not &quot;massive&quot;. You knew and agreed to the prices and had every opportunity to calculate what your bill was going to be.<p>If you were only expecting a $200 bill - that&#x27;s kinda on you. The earthmoving guy has heaps of other customers who spend many times that every single week - and they all started out as some guy who ordered a $200 bobcat or $25k&#x27;s work of D9&#x27;s as a one off. You are just another sale and another prospect in the top of the MRR funnel for him.<p>(Note: See holidayhole.com for a contemporary example of an unbounded earthmoving bill! ;-)  )","time":1480551500,"type":"comment"},
{"by":"lima","id":13075919,"parent":13075831,"retrieved_on":1527836113,"text":"And why SaaS companies hate the AGPL.","time":1480551520,"type":"comment"},
{"by":"kutkloon7","id":13075920,"parent":13075860,"retrieved_on":1527836113,"text":"The thing with C is also that it&#x27;s hard to do metaprogramming. Example, I have some finite element code that ideally, I would like to run for an arbitrary dimension. In C, this is practically impossible to code efficiently, while in C++ (and I suppose in Rust) I belive this can be done with templates (though I have not too much experience with this).","time":1480551527,"type":"comment"},
{"by":"singlebluemind","descendants":0,"id":13075921,"retrieved_on":1527836114,"score":1,"time":1480551545,"title":"About Google, Udacity and Bertelsmann handing out 10,000 scholarships in the EU","type":"story","url":"http:\/\/blog.onyxbits.de\/about-google-udacity-and-bertelsmann-handing-out-10000-scholarships-in-the-eu-560\/"},
{"by":"SwellJoe","id":13075922,"parent":13072155,"retrieved_on":1527836114,"text":"It&#x27;s funny to me that Amazon has looped all the way back around to this, while a bunch of smaller providers who&#x27;ve been doing this for over a decade have been trying to catch up with AWS on all the other fronts. But, realistically, for a <i>lot<\/i> of users, AWS is a stupidly complex beast just to get a website up and running. I&#x27;ve written a bunch of code that interacts with AWS APIs in two languages, and I still require a couple of hours to spin up anything new there.<p>But, as others note, the variable cost factor seems to still be a sticking point. I can setup a Digital Ocean droplet, or Linode, or one of a dozen other low-cost VPS providers, for $5 or $10 a month, and I know it will never cost more than that. Maybe I&#x27;ll bump into memory, disk, or bandwidth limits...but, AWS is a <i>killer<\/i> if you aren&#x27;t careful. I used to maintain (and pay for, out of pocket) a non-profit&#x27;s website on AWS, and the price ballooned while I wasn&#x27;t paying attention, due to automated backups to S3 and some other stuff, and by the time I noticed was costing me $183&#x2F;month, for a website that could <i>easily<\/i> run on a cheap VPS. My fault for not paying closer attention, not setting up cost alerts, etc., but I moved the site off of AWS and onto one of my own web servers, where it literally costs me single digit dollars to run (it has many GBs of email but otherwise is a small site with very low traffic).<p>So...unless they&#x27;re giving me some reason to think I won&#x27;t end up with a massive bill one month because of a popular post, or something, I probably still won&#x27;t think &quot;I know, I&#x27;ll use AWS!&quot;, unless it&#x27;s a situation where I need the scaling capabilities of AWS.","time":1480551587,"type":"comment"},
{"by":"Synaesthesia","id":13075923,"kids":[13076033],"parent":13072459,"retrieved_on":1527836114,"text":"Shock doctrine had some great points like about the economic collapse of Russia and South Africa in the early 90&#x27;s under neoliberalism.","time":1480551596,"type":"comment"},
{"by":"kutkloon7","id":13075924,"kids":[13075932,13076993],"parent":13075913,"retrieved_on":1527836114,"text":"Which -in my opinion- is a lot clearer than the Rust code in the article.","time":1480551599,"type":"comment"},
{"by":"ams6110","id":13075925,"kids":[13076082],"parent":13075763,"retrieved_on":1527836114,"text":"Can&#x27;t read the paywalled story but where I live there&#x27;s really one option for internet: Comcast. So if I literally cut cable, I have nothing (I cut my phone landline years ago, and AT&amp;T has no high-speed internet in my neighborhood anyway).<p>What I do is I have the &quot;basic&quot; TV + internet package, as that&#x27;s actually cheaper bundled than getting internet by itself. I have no ESPN, HBO, etc.<p>I do miss some sports but I catch most games I care about on the radio or online. And the really big games are still usually on &quot;broadcast&quot; channels which I get on my minimal TV package.","time":1480551601,"type":"comment"},
{"by":"neurotech1","id":13075926,"parent":13072296,"retrieved_on":1527836114,"text":"These are going to be insanely expensive. Each FPGA chip costs $50k retail, and unlikely to be cheaper than $10k in volume, so I can&#x27;t imagine the per hour cost being particularly cheap.<p><a href=\"https:&#x2F;&#x2F;octopart.com&#x2F;search?q=VU9P\" rel=\"nofollow\">https:&#x2F;&#x2F;octopart.com&#x2F;search?q=VU9P<\/a>","time":1480551635,"type":"comment"},
{"by":"_FKS_","id":13075927,"parent":13074608,"retrieved_on":1527836114,"text":"Topaz is of the same magnitude as this Tamil Nadu plant, in terms of &quot;rated power&quot;. However, many people seem to miss that &quot;rated power&quot; does not equal &quot;actual output&quot;. Please see capacity factor [1].<p>For a solar plant like this one, the capacity is about at ~25%. If it was 100%, for a 650MW plant, you would get 650 * 365 * 24 = 5694 TWh &#x2F; year. In practice, you will get 5694 * .25 = 1423 TWh &#x2F; year.<p>If this was a nuclear plant, you would get 5694 * .90 = 5124 TWh &#x2F; year. Continously, day and night. Without back-end storage required. Big difference.<p>[1] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Capacity_factor\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Capacity_factor<\/a>","time":1480551640,"type":"comment"},
{"by":"fencepost","id":13075928,"parent":13075686,"retrieved_on":1527836115,"text":"Those are to a large extent different problems. For one you are eliminating requests to outside hosts from your own website and thus avoiding having those outside hosts track your users. For the other, adding encryption, you&#x27;re preventing the carrier being used at either end or in between from tracking which pages on the site are visited but not so effectively whether the site was visited at all. Without the libraries being loaded Google and other CDN Library providers have no way of knowing whether I have visited that site unless they are also providing the underlying network connection that I am using.","time":1480551654,"type":"comment"},
{"by":"Manishearth","id":13075929,"kids":[13076111],"parent":13075908,"retrieved_on":1527836115,"text":"&gt; The snippet presented is completely unreadable to me though<p>I suspect this is just a matter of being used to things. For me, the corresponding imperative code is harder to disentangle. Whereas, knowing what zip&#x2F;map&#x2F;sum do, both the intent and the behavior of the code is abundantly clear to me.","time":1480551661,"type":"comment"},
{"by":"brg","descendants":1,"id":13075930,"kids":[13076008],"retrieved_on":1527836115,"score":5,"time":1480551677,"title":"The History of Machine Learning from the Inside Out","type":"story","url":"http:\/\/www.thetalkingmachines.com\/blog\/2015\/2\/26\/the-history-of-machine-learning-from-the-inside-out"},
{"by":"gnicholas","id":13075931,"kids":[13110657],"parent":13075270,"retrieved_on":1527836115,"text":"Not for individuals — US taxpayers have to pay tax on their worldwide income, though they can get credit for foreign taxes paid to other governments. When the income is received by an entity in a tax haven, there is generally no credit to be had.<p>Speaking generally, if a corporation is owned by fewer than 10 US taxpayers, there is no effective deferral. This is based on the assumption that closely-held companies are being operated at the behest of the owners and will be structured in a way that is tax efficient for the individual owners.<p>Public companies are not subject to these rules, and they can defer paying tax on some types of income.","time":1480551677,"type":"comment"},
{"by":"thenewwazoo","id":13075932,"kids":[13076137,13078438,13075961],"parent":13075924,"retrieved_on":1527836115,"text":"That&#x27;s totally fair, but that may have something to do with how well you know Rust. I obviously don&#x27;t know your familiarity level, but once your mental models &quot;snap&quot; out of thinking about moving data around, and start thinking about operations upon the data, it gets really intuitive.","time":1480551718,"type":"comment"},
{"by":"nitrogen","id":13075933,"parent":13070691,"retrieved_on":1527836115,"text":"Two-way binding is being used without popular mention in some industry-specific areas.  The area I&#x27;m familiar with is control software for audio processing hardware.  Lots of different processing platforms allow the creation of control panels with a drag-and-drop UI, and all widgets assigned to the same hardware state variable are also linked to each other, in all directions.<p>I also implemented my own two-way&#x2F;omnidirectional data binding system ages ago (before I knew what it would even be called) in Java Swing for another audio UI, and all the challenges you mention are real, but as you say, not insurmountable.  Multiple copies of my UI can be controlling the same hardware, and they will all remain in sync without infinite feedback loops, but getting there took lots of work.","time":1480551741,"type":"comment"},
{"by":"Whitestrake","id":13075934,"parent":13073064,"retrieved_on":1527836115,"text":"I don&#x27;t believe he directly requested a comparison. What he asked was <i>why<\/i> the commenter above him chose not to. You seem to acknowledge that in your second sentence, but then go on to state that his comment is reminiscent of asking questions one could answer themselves - asking a commenter why they chose (not) to do something doesn&#x27;t strike me as answerable by a second or third party.","time":1480551765,"type":"comment"},
{"by":"coredog64","id":13075935,"kids":[13076061,13075952,13076013,13076222],"parent":13075910,"retrieved_on":1527836116,"text":"Can&#x27;t make fertilizer or plastic out of solar energy.","time":1480551780,"type":"comment"},
{"by":"jjawssd","id":13075936,"kids":[13076107,13076113],"parent":13075590,"retrieved_on":1527836116,"text":"Smoked cannabis is harmful to the lungs and oral cannabis is easily overdosed.<p>No matter how you spin this one, you have to be careful with whatever road you choose to go down.","time":1480551789,"type":"comment"},
{"by":"serge2k","id":13075937,"parent":13073646,"retrieved_on":1527836116,"text":"You can solve that problem with certification. Sure, the software platform is open but actually building a car and getting it to the road requires certification of the final product.","time":1480551803,"type":"comment"},
{"by":"graeme","id":13075938,"kids":[13076065,13075983],"parent":13075828,"retrieved_on":1527836116,"text":"It&#x27;s particularly perverse, however, to give tax breaks for an industry that has immense negative externalities.","time":1480551815,"type":"comment"},
{"by":"qwertyuiop924","id":13075939,"parent":13075633,"retrieved_on":1527836116,"text":"If it&#x27;s part of LOOP, than it&#x27;s not part of the language, now is it?<p>Well, it is, but you can&#x27;t do it in the general case.<p>You can define a macro for it, though.","time":1480551839,"type":"comment"},
{"by":"sclv","id":13075940,"parent":13069249,"retrieved_on":1527836116,"text":"I think this list is not reflective of a general Haskell outlook. Its reflective of an outlook of people standing _outside_ Haskell (LC is historically a scala-heavy conference)  and projecting onto it a certain sort of structure of expectations that isn&#x27;t actually how Haskellers in general view things. I agree that this misperception isn&#x27;t a good thing for Haskell -- but its a misperception imposed from the _outside_.","time":1480551852,"type":"comment"},
{"by":"mpweiher","id":13075941,"kids":[13076297,13075971,13078628],"parent":13075686,"retrieved_on":1527836116,"text":"These seem completely independent to me.<p>- HTTPS is for attacks.<p>- What the article describes is run-of-the-mill tracking by Google etc.<p>If I am not being attacked, the CDN resources will still allow Google to track me.  If I <i>am<\/i> being attacked the CDN resources will still allow Google to track me.<p>If I don&#x27;t have these Google resources (let&#x27;s just use Google resources for now), I don&#x27;t think that Google will MITM me.","time":1480551869,"type":"comment"},
{"by":"sedachv","id":13075942,"kids":[13076166],"parent":13075714,"retrieved_on":1527836117,"text":"BTW, something that just came to mind: this &quot;bad taste having unbounded consequences&quot; of copying the entire process memory is exactly how fork(2) works.","time":1480551872,"type":"comment"},
{"by":"Manishearth","id":13075943,"kids":[13076428,13075951],"parent":13075913,"retrieved_on":1527836117,"text":"This is incorrect. The C code is more like<p><pre><code>    for (size_t i = 0; i &lt; 12; i++) {\n        sum = 0;\n        for (size_t j = 0; j &lt; 12; j++)\n            sum += coefficients[j] * bufp[i + j];\n        buffer[i + 12] += sum &gt;&gt; qlp_shift;\n    }<\/code><\/pre>","time":1480551874,"type":"comment"},
{"by":"ThrustVectoring","id":13075944,"kids":[13077322],"parent":13075101,"retrieved_on":1527836117,"text":"That&#x27;s not the pitch. The pitch is that you&#x27;re making people feel safer about spending money on your platform.<p>This is one of the fundamental things that make any sort of market work. If it&#x27;s not safe to participate, people won&#x27;t.","time":1480551899,"type":"comment"},
{"by":"yonishechter","id":13075945,"parent":13072157,"retrieved_on":1527836118,"text":"looks interesting.. gonna give it a try, thanks for the recommendation!","time":1480551900,"type":"comment"},
{"by":"i_are_smart","id":13075946,"parent":13073325,"retrieved_on":1527836118,"text":"I disagree with this, in my opinion slack has a lot of features on top of IRC (offline messages, webhooks, etc) that make it much more usable for its target audience.","time":1480551907,"type":"comment"},
{"by":"coredog64","id":13075947,"kids":[13077458,13076031,13076632],"parent":13075777,"retrieved_on":1527836118,"text":"Unless someone figures out how to bulldoze the Rocky mountain range, high speed rail as a replacement for coast to coast air travel is a non starter.","time":1480551917,"type":"comment"},
{"by":"jknoepfler","id":13075948,"parent":13074268,"retrieved_on":1527836118,"text":"you mean like the Amazon retail site?","time":1480551919,"type":"comment"},
{"by":"coldcode","id":13075949,"kids":[13077023,13076118],"parent":13074285,"retrieved_on":1527836118,"text":"Snooper&#x27;s Charter US version. I wonder if their new found hacking powers will survive a court challenge, or will it only be used in parallel prosecutions so no court ever sees it. Guessing the latter.","time":1480551929,"type":"comment"},
{"by":"serge2k","id":13075950,"kids":[13076088],"parent":13075843,"retrieved_on":1527836119,"text":"So if I decide to do a bunch of suspension work and then don&#x27;t bother to get any sort of alignment done am I liable when I get into an accident?","time":1480551930,"type":"comment"},
{"by":"thenewwazoo","id":13075951,"parent":13075943,"retrieved_on":1527836119,"text":"Whoops! You&#x27;re totally right. I missed the outer loop. Thanks for the correction.","time":1480551974,"type":"comment"},
{"by":"msandford","id":13075952,"kids":[13075999,13076163],"parent":13075935,"retrieved_on":1527836119,"text":"&gt; Can&#x27;t make fertilizer or plastic out of solar energy.<p>No, but if you&#x27;re willing to spend a lot of energy you can pull CO2 out of the air and use it as a feedstock to make various fuels or plastics.  Right now I think you&#x27;d have to burn 10 gallons of oil to make a single gallon so that&#x27;s not efficient at all.<p>But if you literally had more solar than you knew what to do with (like Germany does on occasion) you could use that energy to make liquid fuels or plastics.<p>It&#x27;s at least a decade and probably several decades off.  But this is an economic problem, not a technical one.","time":1480552006,"type":"comment"},
{"by":"mozumder","id":13075953,"parent":13075741,"retrieved_on":1527836119,"text":"The problem is the latency associated with software Zlib, on the order of several milliseconds for a typical web response, and the CPU usage the entails, thereby limiting web request-response throughput.","time":1480552010,"type":"comment"},
{"by":"sysadminshowto","dead":true,"id":13075954,"retrieved_on":1527836119,"score":1,"time":1480552041,"title":"IPFire Linux Firewall 2.19 Tutorial","type":"story","url":"http:\/\/bit.ly\/ipfire2"},
{"by":"shas3","id":13075955,"kids":[13077427,13076064,13078010],"parent":13075483,"retrieved_on":1527836119,"text":"Totally on point, regarding multivariate relationships! The problem is not that they do T-test (and other Stat-101-jargon blackbox stuff), but that they stop at it. To many of them, even the existence of multivariate effects is beyond their imagination.<p>So, inference to many biomedical folks is just 1-dimensional. Big data has a long way to go to penetrate fields where people cannot think in more than 1 dimension!","time":1480552070,"type":"comment"},
{"by":"williamle8300","id":13075956,"parent":13075854,"retrieved_on":1527836119,"text":"You don&#x27;t use an RSS reader on your laptop&#x2F;desktop?","time":1480552081,"type":"comment"},
{"by":"openasocket","id":13075957,"kids":[13076086,13077478],"parent":13075843,"retrieved_on":1527836120,"text":"But there are restrictions of what parts you can use. I can&#x27;t just make my own engine and drive around with it without getting that engine certified, right?","time":1480552091,"type":"comment"},
{"by":"networked","descendants":0,"id":13075958,"retrieved_on":1527836120,"score":2,"time":1480552093,"title":"The Company Therapist (1996)","type":"story","url":"http:\/\/www.thetherapist.com\/"},
{"by":"h4nkoslo","id":13075959,"parent":13073861,"retrieved_on":1527836120,"text":"Maybe you should try calling him a racist.  That usually works.","time":1480552097,"type":"comment"},
{"by":"charlesdm","id":13075960,"kids":[13079005],"parent":13074105,"retrieved_on":1527836120,"text":"$100M+ cash? I would assume there are better places to hide that, than in MOSCOW, RUSSIA?<p>How about.. a vault?","time":1480552128,"type":"comment"},
{"deleted":true,"id":13075961,"parent":13075932,"retrieved_on":1527836120,"time":1480552131,"type":"comment"},
{"by":"justanton","id":13075962,"kids":[13076049],"parent":13072311,"retrieved_on":1527836120,"text":"Can someone pls explain the difference between personal and student licenses? They&#x27;re both $20.","time":1480552150,"type":"comment"},
{"by":"k_sze","id":13075963,"parent":13070688,"retrieved_on":1527836120,"text":"Maybe their site is load balanced or regionally served, and they forgot to update on of the servers&#x27; certificate.<p>I did get a confirmation from Wire.com&#x27;s support this morning that they are aware of the problem. Seems fixed now.","time":1480552189,"type":"comment"},
{"by":"bondia","descendants":0,"id":13075964,"retrieved_on":1527836121,"score":2,"time":1480552196,"title":"KDevelop: Seeking maintainer for Ruby language support","type":"story","url":"http:\/\/kfunk.org\/2016\/11\/30\/kdevelop-seeking-maintainer-for-ruby-language-support\/"},
{"by":"kevinnk","id":13075965,"parent":13073852,"retrieved_on":1527836121,"text":"&gt; Outliers are defined as 3 standard deviations from the mean in a normal distribution<p>I kind of agree with your overall point, but that definition is <i>wildly<\/i> incorrect.","time":1480552215,"type":"comment"},
{"by":"dzdt","id":13075966,"parent":13073567,"retrieved_on":1527836121,"text":"Any retail chain has that scale of data in surveillance tapes.  Order of few mb&#x2F;s * 10&#x27;s of cameras per location * 100&#x27;s of locations * 1000&#x27;s of seconds per day * 100&#x27;s of days per year =&gt; order of 10^15 bytes per year.  So far it hasn&#x27;t been economical to collect and analyze these tapes.  But it is approaching feasibility, and AI is reaching the point it could give useful output on that massive input.  Patterns of how shoppers interact with merchandise.  What can you change to sell a few percent more items?","time":1480552237,"type":"comment"},
{"by":"qwertyuiop924","id":13075967,"kids":[13076127,13077456],"parent":13075350,"retrieved_on":1527836121,"text":"As does Scheme share with the other lisps.<p>We took loop, most of generic setters, and readtables from CL.<p>CL took lexical scope, and with it functions distinct from lists, from Scheme.","time":1480552284,"type":"comment"},
{"by":"bigiain","id":13075968,"kids":[13077258,13082052],"parent":13075447,"retrieved_on":1527836121,"text":"(Not entirely sure if you&#x27;re agreeing or disagreeing with me here... ;-)  )<p>So my local Walmart has a Netflix guy who gets 1000 trailers of milk twice a day, and the Dropbox and Yelp guys get a few hundred trailers a week each - and I know these guys from when I see them at the other Walmart in the next town over buying the same sort of amounts there as well. There&#x27;s people like the Obama campaign who we&#x27;d never seen before who fairly quickly ramped up from a gallon a day to a pallet a day, then jumped straight to 50 trailerloads a week for a six months, then stopped buying milk completely one day.<p>What&#x27;s considered &quot;normal&quot;, &quot;unusual&quot;, or &quot;spectacular&quot; -  and to whom?","time":1480552286,"type":"comment"},
{"by":"serge2k","id":13075969,"parent":13075901,"retrieved_on":1527836121,"text":"&gt; The only difference is that it&#x27;s all video-on-demand now<p>And ad free, or pretty much (HBO sometimes has a minute of ads before episodes, at least those are sometimes worth watching. That&#x27;s how I found about westworld, for example).<p>I&#x27;d buy cable if it was ad free (and cheaper).<p>Right now I have netflix, hulu plus, amazon prime (+ motortrend for 5 bucks), hbo now, and nhl gamecenter. It&#x27;s not cheap, and it&#x27;s not the best experience going through apps. It&#x27;s still better than ads.","time":1480552293,"type":"comment"},
{"by":"charlesdm","id":13075970,"parent":13075270,"retrieved_on":1527836122,"text":"If you&#x27;re not a US citizen, yup.","time":1480552298,"type":"comment"},
{"by":"Klathmon","id":13075971,"parent":13075941,"retrieved_on":1527836122,"text":"Google might not MITM you, but a shitty wifi router, your ISP, a hotspot, a hacked device on your network, or the government, and more can and will MITM you.<p>Time and time again you see stories of people having tracking, ads, and malware injected into their browsing from free wifi, most ISPs, cell providers, hacked wifi routers, or even antivirus software.<p>Enabling HTTPS is THE baseline, there&#x27;s no excuse not to have it.","time":1480552313,"type":"comment"},
{"by":"to3m","id":13075972,"parent":13074731,"retrieved_on":1527836122,"text":"It is supported on OS X as well: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;emacs-mirror&#x2F;emacs&#x2F;blob&#x2F;master&#x2F;src&#x2F;unexmacosx.c\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;emacs-mirror&#x2F;emacs&#x2F;blob&#x2F;master&#x2F;src&#x2F;unexma...<\/a><p>(And Windows: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;emacs-mirror&#x2F;emacs&#x2F;blob&#x2F;master&#x2F;src&#x2F;unexw32.c\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;emacs-mirror&#x2F;emacs&#x2F;blob&#x2F;master&#x2F;src&#x2F;unexw3...<\/a>, <a href=\"https:&#x2F;&#x2F;github.com&#x2F;emacs-mirror&#x2F;emacs&#x2F;blob&#x2F;master&#x2F;src&#x2F;w32heap.c#L27\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;emacs-mirror&#x2F;emacs&#x2F;blob&#x2F;master&#x2F;src&#x2F;w32hea...<\/a>)","time":1480552330,"type":"comment"},
{"by":"dimal","id":13075973,"kids":[13083019],"parent":13069813,"retrieved_on":1527836122,"text":"&gt; The researchers are so optimistic that they have applied for so-called breakthrough therapy status with the Food and Drug Administration, which would speed the approval process. If approved, <i>the drug could be available by 2021<\/i>. (my emphasis).<p>The expedited process takes <i>three<\/i> years. No wonder the only way that most drugs get approved is because the drug is patented and the company that brings them to market can expect huge profits. Existing unpatentable (cheap) drugs usually don&#x27;t have a backer with deep pockets to go through this process. Our health care market seems to offer perverse incentives at every turn designed to increase cost and decrease effectiveness.","time":1480552343,"type":"comment"},
{"by":"mpweiher","id":13075974,"kids":[13077384,13076531,13077142,13076281,13076211,13077905,13079125],"parent":13074667,"retrieved_on":1527836122,"text":"&gt;The only proper way to reason about the cost of these<p>&gt;abstractions is to inspect the generated machine code.<p>To me, that&#x27;s a big problem with a lot of these Heldencompilers.  They <i>may<\/i> generate really optimal machine code.  Then again, they may not, and the difference between optimizations working well and not working well in runtime efficiency is so great (I&#x27;ve measured 1000x for Swift) that they might as well be completely different languages.<p>For reference, 1000x means that 1 second turns into 16 minutes, and having that type of difference in something that&#x27;s completely opaque is not a useful performance tool for me, because predictability is at least half the game in performance.  So something like Knuth&#x27;s transformation systems that turn optimization into a dialogue between programmer, compiler and instrumentation seems like a better idea[1].<p>[1] <a href=\"https:&#x2F;&#x2F;www.cs.sjsu.edu&#x2F;~mak&#x2F;CS185C&#x2F;KnuthStructuredProgrammingGoTo.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cs.sjsu.edu&#x2F;~mak&#x2F;CS185C&#x2F;KnuthStructuredProgrammi...<\/a>","time":1480552345,"type":"comment"},
{"by":"johansch","id":13075975,"kids":[13076604],"parent":13073927,"retrieved_on":1527836122,"text":"I&#x27;m betting there&#x27;ll be an &quot;open-awesome&quot; or similar within three years.","time":1480552348,"type":"comment"},
{"by":"bennybriceno","id":13075976,"kids":[13076508],"parent":13075514,"retrieved_on":1527836122,"text":"I would absolutely love anyone&#x27;s input, thanks!","time":1480552352,"type":"comment"},
{"by":"qwertyuiop924","id":13075977,"parent":13075508,"retrieved_on":1527836122,"text":"I will do that.<p>However, I&#x27;ll have to do it next time (if there is one). The core file is missing, the circumstances were vague, and I can&#x27;t reproduce.","time":1480552358,"type":"comment"},
{"by":"nilkn","descendants":0,"id":13075978,"retrieved_on":1527836123,"score":3,"time":1480552363,"title":"The Work of Terence Tao – Tao's Fields Medal Laudatio, by Charles Fefferman [pdf]","type":"story","url":"http:\/\/www.icm2006.org\/proceedings\/Vol_I\/7.pdf"},
{"by":"lwithers","id":13075979,"parent":13073048,"retrieved_on":1527836123,"text":"They do send out emails like this, however they seem fairly flexible. I have several Vultr instances running, and they&#x27;re quite happy for me to fund the account as and when if required, and have never automatically charged me.<p>That said, it is an odd message to send out, and I had my concerns when I first received a similar email. Maybe it&#x27;s something they should look into altering.","time":1480552366,"type":"comment"},
{"by":"kosma","id":13075980,"parent":13075185,"retrieved_on":1527836123,"text":"Go for it before they sell out! :) TME is our primary supplier and from my experience they are not exactly stellar in restocking components when they run out.","time":1480552370,"type":"comment"},
{"by":"Lev1a","id":13075981,"parent":13075842,"retrieved_on":1527836123,"text":"zip is a function&#x2F;method (depending on the language used) that transforms lists of values into A LIST of (n-)tuples of values ending IIRC when the shortest list ends.<p>For example: <a href=\"https:&#x2F;&#x2F;is.gd&#x2F;hrUf7q\" rel=\"nofollow\">https:&#x2F;&#x2F;is.gd&#x2F;hrUf7q<\/a>","time":1480552377,"type":"comment"},
{"by":"nawtacawp","id":13075982,"kids":[13078699],"parent":13071333,"retrieved_on":1527836123,"text":"You may be an outlier. While I completely understand your POV, I think others have taken a different approach. For example -- storage. My mac is basically a thin client. In my basement I have a Dell PowerEdge 1950 with a Intel Xeon 5345, 32GB RAM and a crap load of storage. That is where everything resides and it is completely redundant. It is also where I house VMs, etc. In the past I heavily relied on my desktop -- but I ditched it for a home lab environment.","time":1480552399,"type":"comment"},
{"by":"edblarney","id":13075983,"kids":[13076023,13077552,13076864,13077520,13076034,13077255,13076027],"parent":13075938,"retrieved_on":1527836123,"text":"Oil companies don&#x27;t emit a whole lot of CO2.<p>You emit the CO2 when you use your car (almost 50% of CO2 emissions are from autos).<p>And a bunch of other industries are responsible for most of the rest of CO2 emissions.","time":1480552409,"type":"comment"},
{"by":"JulianMorrison","id":13075984,"parent":13075709,"retrieved_on":1527836123,"text":"That only goes so far.<p>If people literally don&#x27;t want the oil, at some point those tax breaks are going to look vulnerable.","time":1480552413,"type":"comment"},
{"by":"kapitza","id":13075985,"parent":13074789,"retrieved_on":1527836124,"text":"As Jennings Wise (a legitimate historian from the &#x27;30s, his Wilson biography is quite good) said: &quot;Historians must never forget that Woodrow Wilson, despite the efforts of the British police, made it possible for Leon Trotsky to enter Russia with an American passport.&quot;<p>The Germans were not exactly in a position to promote the Bolshevik cause in 1919 (eg, at the proposed Prinkipo conference).  Or in point 6 of the Fourteen Points.<p>The top thread above is giving the Soviet (and American) party-line interpretation of the American &quot;anti-Bolshevik&quot; intervention in the Russian Civil War.  Actually if you read enough primary docs (for instance, the memoir of Graves, who commanded the Siberian force) it quickly becomes clear that the actual goal of the policy was to sandbag the Whites (and, in Siberia, also the Japanese).  The American forces involved are all full of bureaucratic duplicity and all swear up, down, left and sideways that they&#x27;re enemies of godless Bolshevism.  And some of them actually are.<p>&quot;this stuff leads&quot; -- sure.  And reading the NYT leads to Castro-worship, &quot;hands up, don&#x27;t shoot,&quot; Haven Monahan, and other fake news of a sinister persuasion.  <i>If you let it<\/i>.<p>Wise&#x27;s Wilson book is quite good.  It was written in 1937.  The only people who care about it today are anti-Semitic conspiracy theorists.  So what?  Who cares?  They will all die, and the book will still be there.  It&#x27;s a book.<p><a href=\"https:&#x2F;&#x2F;archive.org&#x2F;details&#x2F;WoodrowWilsonJenningsCWise\" rel=\"nofollow\">https:&#x2F;&#x2F;archive.org&#x2F;details&#x2F;WoodrowWilsonJenningsCWise<\/a><p>(This is a badly transcribed bootleg.)","time":1480552417,"type":"comment"},
{"by":"stevesearer","id":13075986,"kids":[13076237,13076025,13076503],"parent":13075514,"retrieved_on":1527836124,"text":"I&#x27;ve taken the approach of just getting rid of &quot;Adtech&quot; altogether and instead sell advertising on a monthly basis like a magazine would.<p>Then I self-host the ads and make sure they are high-quality and static images.<p>The secret is to have your content be in a particular vertical that attracts the types of people who are interested in related products and services. So instead of needing Adtech to creepily figure out who is visiting, the website&#x27;s content does that for you.","time":1480552429,"type":"comment"},
{"by":"gregoor","id":13075987,"parent":13075484,"retrieved_on":1527836124,"text":"A friend of mine actually discovered his latent schizophrenia through Marijuana usage. So yeah, not as safe as people want to believe. I honestly think that there is less mental health risk in taking MDMA, Speed or Alcohol compared to THC.","time":1480552445,"type":"comment"},
{"by":"jonbaer","descendants":0,"id":13075988,"retrieved_on":1527836124,"score":3,"time":1480552446,"title":"Timelapse – Google Earth Engine","type":"story","url":"https:\/\/earthengine.google.com\/timelapse\/"},
{"by":"jbpetersen","id":13075989,"kids":[13076070,13076507],"parent":13075808,"retrieved_on":1527836124,"text":"How&#x27;d you manage those deals?","time":1480552453,"type":"comment"},
{"by":"icomefromreddit","descendants":0,"id":13075990,"retrieved_on":1527836124,"score":2,"time":1480552460,"title":"Data from 130M commuters reveal US ‘megaregions’","type":"story","url":"http:\/\/www.sheffield.ac.uk\/usp\/news\/commuter-data-reveals-us-megaregions-1.665740"},
{"by":"jonbaer","descendants":0,"id":13075991,"retrieved_on":1527836125,"score":4,"time":1480552463,"title":"AI Is Driving Huge Changes at Google, Facebook, and Microsoft","type":"story","url":"https:\/\/www.wired.com\/2016\/11\/google-facebook-microsoft-remaking-around-ai\/"},
{"by":"slm_HN","id":13075992,"kids":[13076018,13076327,13076019,13076021],"parent":13075868,"retrieved_on":1527836125,"text":"The queen sac itself was a mate in two, which is pretty simple even in a rapid game. However he did need to see the mate in 8 before committing to Rc8+.<p>In the end Magnus was much stronger in the rapid games. He was winning in three of the four even though he let one slip to a draw.","time":1480552471,"type":"comment"},
{"by":"alexcasalboni","descendants":0,"id":13075993,"retrieved_on":1527836125,"score":2,"time":1480552473,"title":"AWS Re:Invent 2016 – First Keynote Recap","type":"story","url":"http:\/\/cloudacademy.com\/blog\/aws-reinvent-2016-keynote-andy-jessy\/"},
{"by":"pvorb","descendants":0,"id":13075994,"retrieved_on":1527836125,"score":1,"time":1480552481,"title":"Integration Testing Spring Boot Apps on Travis CI and Sauce Labs","type":"story","url":"https:\/\/vorba.ch\/2016\/integration-testing-spring-boot-travis-saucelabs.html"},
{"by":"fhoffa","id":13075995,"parent":13074600,"retrieved_on":1527836125,"text":"Note that BigQuery has been able to read files straight from GCS, Drive, and even Google Spreadsheets for a while:<p><a href=\"https:&#x2F;&#x2F;cloud.google.com&#x2F;bigquery&#x2F;federated-data-sources\" rel=\"nofollow\">https:&#x2F;&#x2F;cloud.google.com&#x2F;bigquery&#x2F;federated-data-sources<\/a><p>(I&#x27;m Felipe Hoffa and I work for Google <a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;felipehoffa\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;felipehoffa<\/a>)","time":1480552503,"type":"comment"},
{"by":"alistairSH","id":13075996,"kids":[13076603],"parent":13075901,"retrieved_on":1527836125,"text":"I don&#x27;t know.  Netflix appears to have added a lot of licensed content over the last year.  $10&#x2F;month for Netflix vs $65&#x2F;month for basic Fios TV.  I could add HBO Now for $15&#x2F;month and still be money ahead.","time":1480552515,"type":"comment"},
{"by":"trhway","id":13075997,"kids":[13076179],"parent":13075845,"retrieved_on":1527836125,"text":"&gt;capitalists; ... their program for world domination has mostly succeeded<p>Unfortunately human race hasn&#x27;t been able to come up with a better thing yet. Most of the 20th century was spent on  implementation (and dealing with consequences) of the 2 most progressive (as they looked back then and as the theories like the Marx&#x27;s state) approaches - communism and fascism (the both actually almost the same in the core - total government economical and political control). We all know the results of those approaches.","time":1480552528,"type":"comment"},
{"by":"chriswarbo","id":13075998,"kids":[13076053],"parent":13075736,"retrieved_on":1527836126,"text":"You&#x27;re absolutely right that various hacks can be employed in Haskell; as well as missing branches, we can also exploit laziness to provide &quot;undefined&quot; or &quot;loop = loop&quot; expressions which, if we&#x27;re right, won&#x27;t ever be evaluated.<p>I didn&#x27;t mean to imply that dynamic languages are &quot;better&quot; because they allow unchecked combinations of everything with everything else. Although I also didn&#x27;t mean to imply that they&#x27;re <i>strictly<\/i> &quot;worse&quot;, precisely because there are things we can express easily in dynamic languages which take effort to reproduce in something like Haskell.<p>My main reason to mention dynamic languages was as motivation for why you might want to write such code in the first place: using dependent types to, say, prove Euclid&#x27;s theorem of the infinitude of primes, would probably not motivate many software developers to give Idris a try. Examples like the type-safe printf mentioned in a sibling comment would presumably be much better motivators: we compute a type based on the format string, so providing a string like &quot;Hello world %f %s !&quot; will produce a type `Float -&gt; String -&gt; String` which accepts the required Float and String parameters, then returns the resulting String.","time":1480552534,"type":"comment"},
{"by":"labster","id":13075999,"kids":[13076015],"parent":13075952,"retrieved_on":1527836126,"text":"In California and other deserts, excess solar can be directed to desalination plants. Our water and energy shortages are essentially the same issue; solving one goes a long way to solving the other.","time":1480552540,"type":"comment"},
{"by":"adventurer","id":13076000,"parent":13075789,"retrieved_on":1527836126,"text":"I&#x27;m sort of in the same boat? I don&#x27;t want cable but it is cheaper bundling it with internet. I receive two extra channels than I would get from an antenna and the cable company tells shareholders their subscriber base is still going strong.","time":1480552544,"type":"comment"},
{"by":"vacri","id":13076001,"parent":13069311,"retrieved_on":1527836126,"text":"While it may sound callous, if that 8-year-old did not produce viable offspring that could mature to reproductive age themselves, she is irrelevant to evolution. Conception is not synonymous with viable offspring.<p>As for the 8-year-old hunter, just how self-sufficient can they be? Procuring their own weapons, transporting their own carcasses, preparing healthy meals multiple times per day on an ongoing basis... the idea that you could just loose a 7-8 year old into the woods with a weapon and they&#x27;d survive in an ongoing sense is a bit far-fetched. Teaching someone to sneak, track, and point a gun is not the same as them being self-sufficient.","time":1480552549,"type":"comment"},
{"by":"flashman","id":13076002,"parent":13072308,"retrieved_on":1527836126,"text":"Someone&#x27;s going to hack this into a doorbell that pushes the visitor&#x27;s name to their phone.","time":1480552552,"type":"comment"},
{"by":"fortawesome","id":13076003,"parent":13075917,"retrieved_on":1527836126,"text":"They&#x27;re back! Was just a hiccup. :)","time":1480552557,"type":"comment"},
{"by":"archagon","descendants":0,"id":13076004,"retrieved_on":1527836126,"score":2,"time":1480552559,"title":"Show HN: MusicMessages, a collaborative step sequencer for iMessage","type":"story","url":"http:\/\/musicmessages.io"},
{"by":"megablast","id":13076005,"kids":[13077591],"parent":13073695,"retrieved_on":1527836127,"text":"Why $200M?? What not just stay with $100M? etc...","time":1480552567,"type":"comment"},
{"by":"NTDF9","id":13076006,"kids":[13076060,13076146],"parent":13071649,"retrieved_on":1527836127,"text":"A very interesting question about divorce asset-splitting:<p>How are assets split if the woman (in the above story) cheated instead of the high net worth man and the man filed for divorce? Who gets what?","time":1480552577,"type":"comment"},
{"by":"pselbert","id":13076007,"parent":13075809,"retrieved_on":1527836127,"text":"Yes. While I completely agree with the author and their quest to eliminate third party scripts from their site, the problem isn&#x27;t with CDNs. The problem is with third party scripts, most of which aren&#x27;t coming from a typical CDN (cdnjs, for example).<p>It is entirely valid, and common, to front your own application code behind a CDN.<p>Love the sentiment, just wish the terminology was more accurate.","time":1480552598,"type":"comment"},
{"by":"closed","id":13076008,"parent":13075930,"retrieved_on":1527836127,"text":"Latent factor models have a really interesting history. They were developed heavily by psychologists (among others) over the past century, for use in testing and assessment. Nowadays, it&#x27;s pretty interesting to see people in ML sometimes resurrect an old factor modeling approach, and make it scale, apply it to something radically different, etc..","time":1480552626,"type":"comment"},
{"by":"slg","id":13076009,"kids":[13076032],"parent":13075512,"retrieved_on":1527836127,"text":"I can&#x27;t read the pay-walled article, but based off my own habits I do wonder what has really changed.  I don&#x27;t have cable, but I pay Netflix, Amazon, HBO, Sling, MLB, and the NFL anywhere from $8-$25 per month.  At this point, that isn&#x27;t much different than the old model.  I&#x27;m not saving any real money and I still pay for plenty of content that I have absolutely zero interest in ever watching.  The only difference is that instead of paying a single middleman for my TV, I moved slightly upstream and pay a handful of providers.","time":1480552635,"type":"comment"},
{"by":"babanature","dead":true,"id":13076010,"retrieved_on":1527836127,"score":1,"time":1480552640,"title":"WordPress Launch Checklist: 11 Things You Must Do – Onenaija Blog","type":"story","url":"http:\/\/onenaijablog.com\/2016\/11\/wordpress-checklist\/"},
{"by":"CapitalistCartr","id":13076011,"parent":13074998,"retrieved_on":1527836127,"text":"$953,404.   It looks like they will.  I kicked in $20 because how could I not.","time":1480552645,"type":"comment"},
{"by":"jxramos","id":13076012,"parent":13072096,"retrieved_on":1527836128,"text":"Nice application of disinformation! Keep up the good work.","time":1480552663,"type":"comment"},
{"by":"maxerickson","id":13076013,"kids":[13076066],"parent":13075935,"retrieved_on":1527836128,"text":"There&#x27;s a process for fixing nitrogen using electricity as the primary input:<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Birkeland%E2%80%93Eyde_process\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Birkeland%E2%80%93Eyde_process<\/a><p>You can also plant nitrogen fixing plants and till them into the soil at the end of the season.","time":1480552668,"type":"comment"},
{"by":"viewtransform","id":13076014,"parent":13075201,"retrieved_on":1527836128,"text":"I got fed up with delicious and moved to pinboard.in several months ago. I am very pleased with the service $11&#x2F;year and will continue to support the developer.","time":1480552673,"type":"comment"},
{"by":"toomuchtodo","id":13076015,"kids":[13077343,13077140],"parent":13075999,"retrieved_on":1527836128,"text":"All resource problems are energy problems. With enough clean energy, you can make fuel, water, fertilizer, anything.<p>We&#x27;re going to need <i>a lot<\/i> of surplus energy to sequester all of the CO2 we&#x27;ve pumped into the atmosphere over the last 100+ years.","time":1480552677,"type":"comment"},
{"by":"duskwuff","id":13076016,"parent":13075760,"retrieved_on":1527836128,"text":"<a href=\"https:&#x2F;&#x2F;aws.amazon.com&#x2F;ec2&#x2F;instance-types&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;aws.amazon.com&#x2F;ec2&#x2F;instance-types&#x2F;<\/a><p>Scroll down to &quot;F1&quot;; it says:<p>&gt; Xilinx UltraScale+ VU9P FPGAs<p>The VU9P isn&#x27;t available through DigiKey, but is listed by Avnet. I don&#x27;t know which specific package and speed grade Amazon is using, but here&#x27;s one:<p><a href=\"https:&#x2F;&#x2F;products.avnet.com&#x2F;shop&#x2F;en&#x2F;asia&#x2F;programmable-logic&#x2F;fpga&#x2F;xcvu9p-l2flgb2104ees9839-3074457345630107345&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;products.avnet.com&#x2F;shop&#x2F;en&#x2F;asia&#x2F;programmable-logic&#x2F;f...<\/a>","time":1480552678,"type":"comment"},
{"by":"fastest963","id":13076017,"parent":13073048,"retrieved_on":1527836128,"text":"Wow, I&#x27;ve never had that happen all the emails I&#x27;ve gotten from them have said they&#x27;ll automatically deposit $10. Never had anything over $10.","time":1480552689,"type":"comment"},
{"by":"CalChris","id":13076018,"kids":[13076728,13076889],"parent":13075992,"retrieved_on":1527836128,"text":"Game two of the rapids playoff was a fine ending by Karjakin, a stalemate after sacking everything. But MC the WC was much stronger at rapid.","time":1480552709,"type":"comment"},
{"dead":true,"deleted":true,"id":13076019,"parent":13075992,"retrieved_on":1527836129,"time":1480552711,"type":"comment"},
{"by":"st3v3r","id":13076020,"kids":[13077793],"parent":13074810,"retrieved_on":1527836129,"text":"That&#x27;s not really an OS level thing, though. That&#x27;s an application level thing. Finder was chosen not to be extensible, and Explorer was. There are Finder replacements that are.","time":1480552711,"type":"comment"},
{"deleted":true,"id":13076021,"parent":13075992,"retrieved_on":1527836129,"time":1480552714,"type":"comment"},
{"by":"estebank","id":13076022,"kids":[13076052],"parent":13075100,"retrieved_on":1527836129,"text":"How can you differentiate between different &quot;types of noise&quot;? If the traffic is cryptographically sound, the signal is indistinguishable from the noise. If the messages from multiple people have a guessable seed, in such a way that you can identify what is noise, it just means that the system is not cryptographically sound.","time":1480552735,"type":"comment"},
{"by":"monknomo","id":13076023,"kids":[13079719,13076071],"parent":13075983,"retrieved_on":1527836129,"text":"I think you&#x27;re missing the negative externalities inherent in oil extraction, like groundwater pollution, earthquakes, above ground pipelines, etc.<p>Not to mention it&#x27;s a little like saying Pablo Escobar doesn&#x27;t OD on drugs or steal your TV very often, it&#x27;s the crackheads that do that...","time":1480552743,"type":"comment"},
{"by":"welly","id":13076024,"parent":13072413,"retrieved_on":1527836129,"text":"And you know for sure that the model is sporting a top knot.","time":1480552769,"type":"comment"},
{"by":"jesserwilliams","id":13076025,"parent":13075986,"retrieved_on":1527836129,"text":"I don&#x27;t think that getting rid of &#x27;Adtech&#x27; altogether is the answer. It&#x27;s still a valuable source of revenue for many companies.<p>The point of the article was that the way &#x27;Adtech&#x27; is currently used is broken. Ads shouldn&#x27;t be a frustration or interruption to the native experiences where they are hosted.<p>I like the concept of RAM (Reward Activated Marketing) mentioned in the article, it takes into account UX, and good UX will always win.","time":1480552774,"type":"comment"},
{"by":"NamTaf","id":13076026,"kids":[13080047],"parent":13073080,"retrieved_on":1527836130,"text":"No it doesn&#x27;t, because most everyday users don&#x27;t give a toss about security. It has to be something that is pushed as a best-practice by those who know better, not something that is demanded by an everyday user who doesn&#x27;t. The invisible hand won&#x27;t do shit here.","time":1480552781,"type":"comment"},
{"deleted":true,"id":13076027,"parent":13075983,"retrieved_on":1527836130,"time":1480552784,"type":"comment"}]